; domain
(define (domain grid-visit-all)
(:requirements :typing)
(:types        place - object)
(:predicates (connected ?x ?y - place)
	     (at-robot ?x - place)
	     (visited ?x - place)
)
	
(:action move
:parameters (?curpos ?nextpos - place)
:precondition (and (at-robot ?curpos) (connected ?curpos ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos)) (visited ?nextpos))
)

)

; problem
(define (problem grid-8)
(:domain grid-visit-all)
(:objects 
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x0-y4
	loc-x0-y5
	loc-x0-y6
	loc-x0-y7
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x1-y4
	loc-x1-y5
	loc-x1-y6
	loc-x1-y7
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x2-y4
	loc-x2-y5
	loc-x2-y6
	loc-x2-y7
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
	loc-x3-y4
	loc-x3-y5
	loc-x3-y6
	loc-x3-y7
	loc-x4-y0
	loc-x4-y1
	loc-x4-y2
	loc-x4-y3
	loc-x4-y4
	loc-x4-y5
	loc-x4-y6
	loc-x4-y7
	loc-x5-y0
	loc-x5-y1
	loc-x5-y2
	loc-x5-y3
	loc-x5-y4
	loc-x5-y5
	loc-x5-y6
	loc-x5-y7
	loc-x6-y0
	loc-x6-y1
	loc-x6-y2
	loc-x6-y3
	loc-x6-y4
	loc-x6-y5
	loc-x6-y6
	loc-x6-y7
	loc-x7-y0
	loc-x7-y1
	loc-x7-y2
	loc-x7-y3
	loc-x7-y4
	loc-x7-y5
	loc-x7-y6
	loc-x7-y7
- place 
        
)
(:init
	(at-robot loc-x4-y4)
	(visited loc-x4-y4)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x0-y3 loc-x0-y4)
 	(connected loc-x0-y4 loc-x1-y4)
 	(connected loc-x0-y4 loc-x0-y3)
 	(connected loc-x0-y4 loc-x0-y5)
 	(connected loc-x0-y5 loc-x1-y5)
 	(connected loc-x0-y5 loc-x0-y4)
 	(connected loc-x0-y5 loc-x0-y6)
 	(connected loc-x0-y6 loc-x1-y6)
 	(connected loc-x0-y6 loc-x0-y5)
 	(connected loc-x0-y6 loc-x0-y7)
 	(connected loc-x0-y7 loc-x1-y7)
 	(connected loc-x0-y7 loc-x0-y6)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x1-y3 loc-x1-y4)
 	(connected loc-x1-y4 loc-x0-y4)
 	(connected loc-x1-y4 loc-x2-y4)
 	(connected loc-x1-y4 loc-x1-y3)
 	(connected loc-x1-y4 loc-x1-y5)
 	(connected loc-x1-y5 loc-x0-y5)
 	(connected loc-x1-y5 loc-x2-y5)
 	(connected loc-x1-y5 loc-x1-y4)
 	(connected loc-x1-y5 loc-x1-y6)
 	(connected loc-x1-y6 loc-x0-y6)
 	(connected loc-x1-y6 loc-x2-y6)
 	(connected loc-x1-y6 loc-x1-y5)
 	(connected loc-x1-y6 loc-x1-y7)
 	(connected loc-x1-y7 loc-x0-y7)
 	(connected loc-x1-y7 loc-x2-y7)
 	(connected loc-x1-y7 loc-x1-y6)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x2-y3 loc-x2-y4)
 	(connected loc-x2-y4 loc-x1-y4)
 	(connected loc-x2-y4 loc-x3-y4)
 	(connected loc-x2-y4 loc-x2-y3)
 	(connected loc-x2-y4 loc-x2-y5)
 	(connected loc-x2-y5 loc-x1-y5)
 	(connected loc-x2-y5 loc-x3-y5)
 	(connected loc-x2-y5 loc-x2-y4)
 	(connected loc-x2-y5 loc-x2-y6)
 	(connected loc-x2-y6 loc-x1-y6)
 	(connected loc-x2-y6 loc-x3-y6)
 	(connected loc-x2-y6 loc-x2-y5)
 	(connected loc-x2-y6 loc-x2-y7)
 	(connected loc-x2-y7 loc-x1-y7)
 	(connected loc-x2-y7 loc-x3-y7)
 	(connected loc-x2-y7 loc-x2-y6)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x4-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x4-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x4-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x4-y3)
 	(connected loc-x3-y3 loc-x3-y2)
 	(connected loc-x3-y3 loc-x3-y4)
 	(connected loc-x3-y4 loc-x2-y4)
 	(connected loc-x3-y4 loc-x4-y4)
 	(connected loc-x3-y4 loc-x3-y3)
 	(connected loc-x3-y4 loc-x3-y5)
 	(connected loc-x3-y5 loc-x2-y5)
 	(connected loc-x3-y5 loc-x4-y5)
 	(connected loc-x3-y5 loc-x3-y4)
 	(connected loc-x3-y5 loc-x3-y6)
 	(connected loc-x3-y6 loc-x2-y6)
 	(connected loc-x3-y6 loc-x4-y6)
 	(connected loc-x3-y6 loc-x3-y5)
 	(connected loc-x3-y6 loc-x3-y7)
 	(connected loc-x3-y7 loc-x2-y7)
 	(connected loc-x3-y7 loc-x4-y7)
 	(connected loc-x3-y7 loc-x3-y6)
 	(connected loc-x4-y0 loc-x3-y0)
 	(connected loc-x4-y0 loc-x5-y0)
 	(connected loc-x4-y0 loc-x4-y1)
 	(connected loc-x4-y1 loc-x3-y1)
 	(connected loc-x4-y1 loc-x5-y1)
 	(connected loc-x4-y1 loc-x4-y0)
 	(connected loc-x4-y1 loc-x4-y2)
 	(connected loc-x4-y2 loc-x3-y2)
 	(connected loc-x4-y2 loc-x5-y2)
 	(connected loc-x4-y2 loc-x4-y1)
 	(connected loc-x4-y2 loc-x4-y3)
 	(connected loc-x4-y3 loc-x3-y3)
 	(connected loc-x4-y3 loc-x5-y3)
 	(connected loc-x4-y3 loc-x4-y2)
 	(connected loc-x4-y3 loc-x4-y4)
 	(connected loc-x4-y4 loc-x3-y4)
 	(connected loc-x4-y4 loc-x5-y4)
 	(connected loc-x4-y4 loc-x4-y3)
 	(connected loc-x4-y4 loc-x4-y5)
 	(connected loc-x4-y5 loc-x3-y5)
 	(connected loc-x4-y5 loc-x5-y5)
 	(connected loc-x4-y5 loc-x4-y4)
 	(connected loc-x4-y5 loc-x4-y6)
 	(connected loc-x4-y6 loc-x3-y6)
 	(connected loc-x4-y6 loc-x5-y6)
 	(connected loc-x4-y6 loc-x4-y5)
 	(connected loc-x4-y6 loc-x4-y7)
 	(connected loc-x4-y7 loc-x3-y7)
 	(connected loc-x4-y7 loc-x5-y7)
 	(connected loc-x4-y7 loc-x4-y6)
 	(connected loc-x5-y0 loc-x4-y0)
 	(connected loc-x5-y0 loc-x6-y0)
 	(connected loc-x5-y0 loc-x5-y1)
 	(connected loc-x5-y1 loc-x4-y1)
 	(connected loc-x5-y1 loc-x6-y1)
 	(connected loc-x5-y1 loc-x5-y0)
 	(connected loc-x5-y1 loc-x5-y2)
 	(connected loc-x5-y2 loc-x4-y2)
 	(connected loc-x5-y2 loc-x6-y2)
 	(connected loc-x5-y2 loc-x5-y1)
 	(connected loc-x5-y2 loc-x5-y3)
 	(connected loc-x5-y3 loc-x4-y3)
 	(connected loc-x5-y3 loc-x6-y3)
 	(connected loc-x5-y3 loc-x5-y2)
 	(connected loc-x5-y3 loc-x5-y4)
 	(connected loc-x5-y4 loc-x4-y4)
 	(connected loc-x5-y4 loc-x6-y4)
 	(connected loc-x5-y4 loc-x5-y3)
 	(connected loc-x5-y4 loc-x5-y5)
 	(connected loc-x5-y5 loc-x4-y5)
 	(connected loc-x5-y5 loc-x6-y5)
 	(connected loc-x5-y5 loc-x5-y4)
 	(connected loc-x5-y5 loc-x5-y6)
 	(connected loc-x5-y6 loc-x4-y6)
 	(connected loc-x5-y6 loc-x6-y6)
 	(connected loc-x5-y6 loc-x5-y5)
 	(connected loc-x5-y6 loc-x5-y7)
 	(connected loc-x5-y7 loc-x4-y7)
 	(connected loc-x5-y7 loc-x6-y7)
 	(connected loc-x5-y7 loc-x5-y6)
 	(connected loc-x6-y0 loc-x5-y0)
 	(connected loc-x6-y0 loc-x7-y0)
 	(connected loc-x6-y0 loc-x6-y1)
 	(connected loc-x6-y1 loc-x5-y1)
 	(connected loc-x6-y1 loc-x7-y1)
 	(connected loc-x6-y1 loc-x6-y0)
 	(connected loc-x6-y1 loc-x6-y2)
 	(connected loc-x6-y2 loc-x5-y2)
 	(connected loc-x6-y2 loc-x7-y2)
 	(connected loc-x6-y2 loc-x6-y1)
 	(connected loc-x6-y2 loc-x6-y3)
 	(connected loc-x6-y3 loc-x5-y3)
 	(connected loc-x6-y3 loc-x7-y3)
 	(connected loc-x6-y3 loc-x6-y2)
 	(connected loc-x6-y3 loc-x6-y4)
 	(connected loc-x6-y4 loc-x5-y4)
 	(connected loc-x6-y4 loc-x7-y4)
 	(connected loc-x6-y4 loc-x6-y3)
 	(connected loc-x6-y4 loc-x6-y5)
 	(connected loc-x6-y5 loc-x5-y5)
 	(connected loc-x6-y5 loc-x7-y5)
 	(connected loc-x6-y5 loc-x6-y4)
 	(connected loc-x6-y5 loc-x6-y6)
 	(connected loc-x6-y6 loc-x5-y6)
 	(connected loc-x6-y6 loc-x7-y6)
 	(connected loc-x6-y6 loc-x6-y5)
 	(connected loc-x6-y6 loc-x6-y7)
 	(connected loc-x6-y7 loc-x5-y7)
 	(connected loc-x6-y7 loc-x7-y7)
 	(connected loc-x6-y7 loc-x6-y6)
 	(connected loc-x7-y0 loc-x6-y0)
 	(connected loc-x7-y0 loc-x7-y1)
 	(connected loc-x7-y1 loc-x6-y1)
 	(connected loc-x7-y1 loc-x7-y0)
 	(connected loc-x7-y1 loc-x7-y2)
 	(connected loc-x7-y2 loc-x6-y2)
 	(connected loc-x7-y2 loc-x7-y1)
 	(connected loc-x7-y2 loc-x7-y3)
 	(connected loc-x7-y3 loc-x6-y3)
 	(connected loc-x7-y3 loc-x7-y2)
 	(connected loc-x7-y3 loc-x7-y4)
 	(connected loc-x7-y4 loc-x6-y4)
 	(connected loc-x7-y4 loc-x7-y3)
 	(connected loc-x7-y4 loc-x7-y5)
 	(connected loc-x7-y5 loc-x6-y5)
 	(connected loc-x7-y5 loc-x7-y4)
 	(connected loc-x7-y5 loc-x7-y6)
 	(connected loc-x7-y6 loc-x6-y6)
 	(connected loc-x7-y6 loc-x7-y5)
 	(connected loc-x7-y6 loc-x7-y7)
 	(connected loc-x7-y7 loc-x6-y7)
 	(connected loc-x7-y7 loc-x7-y6)
 
)
(:goal
(and 
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x0-y2)
	(visited loc-x0-y3)
	(visited loc-x0-y4)
	(visited loc-x0-y5)
	(visited loc-x0-y6)
	(visited loc-x0-y7)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
	(visited loc-x1-y2)
	(visited loc-x1-y3)
	(visited loc-x1-y4)
	(visited loc-x1-y5)
	(visited loc-x1-y6)
	(visited loc-x1-y7)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
	(visited loc-x2-y2)
	(visited loc-x2-y3)
	(visited loc-x2-y4)
	(visited loc-x2-y5)
	(visited loc-x2-y6)
	(visited loc-x2-y7)
	(visited loc-x3-y0)
	(visited loc-x3-y1)
	(visited loc-x3-y2)
	(visited loc-x3-y3)
	(visited loc-x3-y4)
	(visited loc-x3-y5)
	(visited loc-x3-y6)
	(visited loc-x3-y7)
	(visited loc-x4-y0)
	(visited loc-x4-y1)
	(visited loc-x4-y2)
	(visited loc-x4-y3)
	(visited loc-x4-y4)
	(visited loc-x4-y5)
	(visited loc-x4-y6)
	(visited loc-x4-y7)
	(visited loc-x5-y0)
	(visited loc-x5-y1)
	(visited loc-x5-y2)
	(visited loc-x5-y3)
	(visited loc-x5-y4)
	(visited loc-x5-y5)
	(visited loc-x5-y6)
	(visited loc-x5-y7)
	(visited loc-x6-y0)
	(visited loc-x6-y1)
	(visited loc-x6-y2)
	(visited loc-x6-y3)
	(visited loc-x6-y4)
	(visited loc-x6-y5)
	(visited loc-x6-y6)
	(visited loc-x6-y7)
	(visited loc-x7-y0)
	(visited loc-x7-y1)
	(visited loc-x7-y2)
	(visited loc-x7-y3)
	(visited loc-x7-y4)
	(visited loc-x7-y5)
	(visited loc-x7-y6)
	(visited loc-x7-y7)
)
)
)

; plan
1. (move loc-x4-y4 loc-x3-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x3-y4) (visited loc-x3-y4)
   goals met: 2 of 64
2. (move loc-x3-y4 loc-x2-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x2-y4) (visited loc-x2-y4)
   goals met: 3 of 64
3. (move loc-x2-y4 loc-x2-y3)
   deleted: (at-robot loc-x2-y4)
   added: (at-robot loc-x2-y3) (visited loc-x2-y3)
   goals met: 4 of 64
4. (move loc-x2-y3 loc-x1-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x1-y3) (visited loc-x1-y3)
   goals met: 5 of 64
5. (move loc-x1-y3 loc-x0-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x0-y3) (visited loc-x0-y3)
   goals met: 6 of 64
6. (move loc-x0-y3 loc-x0-y2)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x0-y2) (visited loc-x0-y2)
   goals met: 7 of 64
7. (move loc-x0-y2 loc-x0-y1)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x0-y1) (visited loc-x0-y1)
   goals met: 8 of 64
8. (move loc-x0-y1 loc-x0-y0)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y0) (visited loc-x0-y0)
   goals met: 9 of 64
9. (move loc-x0-y0 loc-x1-y0)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x1-y0) (visited loc-x1-y0)
   goals met: 10 of 64
10. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1) (visited loc-x1-y1)
   goals met: 11 of 64
11. (move loc-x1-y1 loc-x2-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x2-y1) (visited loc-x2-y1)
   goals met: 12 of 64
12. (move loc-x2-y1 loc-x2-y0)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y0) (visited loc-x2-y0)
   goals met: 13 of 64
13. (move loc-x2-y0 loc-x3-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x3-y0) (visited loc-x3-y0)
   goals met: 14 of 64
14. (move loc-x3-y0 loc-x3-y1)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x3-y1) (visited loc-x3-y1)
   goals met: 15 of 64
15. (move loc-x3-y1 loc-x3-y2)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x3-y2) (visited loc-x3-y2)
   goals met: 16 of 64
16. (move loc-x3-y2 loc-x2-y2)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x2-y2) (visited loc-x2-y2)
   goals met: 17 of 64
17. (move loc-x2-y2 loc-x1-y2)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x1-y2) (visited loc-x1-y2)
   goals met: 18 of 64
18. (move loc-x1-y2 loc-x1-y3)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y3)
   goals met: 18 of 64
19. (move loc-x1-y3 loc-x1-y4)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y4) (visited loc-x1-y4)
   goals met: 19 of 64
20. (move loc-x1-y4 loc-x0-y4)
   deleted: (at-robot loc-x1-y4)
   added: (at-robot loc-x0-y4) (visited loc-x0-y4)
   goals met: 20 of 64
21. (move loc-x0-y4 loc-x0-y5)
   deleted: (at-robot loc-x0-y4)
   added: (at-robot loc-x0-y5) (visited loc-x0-y5)
   goals met: 21 of 64
22. (move loc-x0-y5 loc-x0-y6)
   deleted: (at-robot loc-x0-y5)
   added: (at-robot loc-x0-y6) (visited loc-x0-y6)
   goals met: 22 of 64
23. (move loc-x0-y6 loc-x0-y7)
   deleted: (at-robot loc-x0-y6)
   added: (at-robot loc-x0-y7) (visited loc-x0-y7)
   goals met: 23 of 64
24. (move loc-x0-y7 loc-x1-y7)
   deleted: (at-robot loc-x0-y7)
   added: (at-robot loc-x1-y7) (visited loc-x1-y7)
   goals met: 24 of 64
25. (move loc-x1-y7 loc-x1-y6)
   deleted: (at-robot loc-x1-y7)
   added: (at-robot loc-x1-y6) (visited loc-x1-y6)
   goals met: 25 of 64
26. (move loc-x1-y6 loc-x1-y5)
   deleted: (at-robot loc-x1-y6)
   added: (at-robot loc-x1-y5) (visited loc-x1-y5)
   goals met: 26 of 64
27. (move loc-x1-y5 loc-x2-y5)
   deleted: (at-robot loc-x1-y5)
   added: (at-robot loc-x2-y5) (visited loc-x2-y5)
   goals met: 27 of 64
28. (move loc-x2-y5 loc-x2-y6)
   deleted: (at-robot loc-x2-y5)
   added: (at-robot loc-x2-y6) (visited loc-x2-y6)
   goals met: 28 of 64
29. (move loc-x2-y6 loc-x2-y7)
   deleted: (at-robot loc-x2-y6)
   added: (at-robot loc-x2-y7) (visited loc-x2-y7)
   goals met: 29 of 64
30. (move loc-x2-y7 loc-x3-y7)
   deleted: (at-robot loc-x2-y7)
   added: (at-robot loc-x3-y7) (visited loc-x3-y7)
   goals met: 30 of 64
31. (move loc-x3-y7 loc-x4-y7)
   deleted: (at-robot loc-x3-y7)
   added: (at-robot loc-x4-y7) (visited loc-x4-y7)
   goals met: 31 of 64
32. (move loc-x4-y7 loc-x4-y6)
   deleted: (at-robot loc-x4-y7)
   added: (at-robot loc-x4-y6) (visited loc-x4-y6)
   goals met: 32 of 64
33. (move loc-x4-y6 loc-x3-y6)
   deleted: (at-robot loc-x4-y6)
   added: (at-robot loc-x3-y6) (visited loc-x3-y6)
   goals met: 33 of 64
34. (move loc-x3-y6 loc-x3-y5)
   deleted: (at-robot loc-x3-y6)
   added: (at-robot loc-x3-y5) (visited loc-x3-y5)
   goals met: 34 of 64
35. (move loc-x3-y5 loc-x4-y5)
   deleted: (at-robot loc-x3-y5)
   added: (at-robot loc-x4-y5) (visited loc-x4-y5)
   goals met: 35 of 64
36. (move loc-x4-y5 loc-x4-y4)
   deleted: (at-robot loc-x4-y5)
   added: (at-robot loc-x4-y4)
   goals met: 35 of 64
37. (move loc-x4-y4 loc-x4-y3)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x4-y3) (visited loc-x4-y3)
   goals met: 36 of 64
38. (move loc-x4-y3 loc-x4-y2)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x4-y2) (visited loc-x4-y2)
   goals met: 37 of 64
39. (move loc-x4-y2 loc-x4-y1)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x4-y1) (visited loc-x4-y1)
   goals met: 38 of 64
40. (move loc-x4-y1 loc-x4-y0)
   deleted: (at-robot loc-x4-y1)
   added: (at-robot loc-x4-y0) (visited loc-x4-y0)
   goals met: 39 of 64
41. (move loc-x4-y0 loc-x5-y0)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x5-y0) (visited loc-x5-y0)
   goals met: 40 of 64
42. (move loc-x5-y0 loc-x5-y1)
   deleted: (at-robot loc-x5-y0)
   added: (at-robot loc-x5-y1) (visited loc-x5-y1)
   goals met: 41 of 64
43. (move loc-x5-y1 loc-x6-y1)
   deleted: (at-robot loc-x5-y1)
   added: (at-robot loc-x6-y1) (visited loc-x6-y1)
   goals met: 42 of 64
44. (move loc-x6-y1 loc-x6-y0)
   deleted: (at-robot loc-x6-y1)
   added: (at-robot loc-x6-y0) (visited loc-x6-y0)
   goals met: 43 of 64
45. (move loc-x6-y0 loc-x7-y0)
   deleted: (at-robot loc-x6-y0)
   added: (at-robot loc-x7-y0) (visited loc-x7-y0)
   goals met: 44 of 64
46. (move loc-x7-y0 loc-x7-y1)
   deleted: (at-robot loc-x7-y0)
   added: (at-robot loc-x7-y1) (visited loc-x7-y1)
   goals met: 45 of 64
47. (move loc-x7-y1 loc-x7-y2)
   deleted: (at-robot loc-x7-y1)
   added: (at-robot loc-x7-y2) (visited loc-x7-y2)
   goals met: 46 of 64
48. (move loc-x7-y2 loc-x7-y3)
   deleted: (at-robot loc-x7-y2)
   added: (at-robot loc-x7-y3) (visited loc-x7-y3)
   goals met: 47 of 64
49. (move loc-x7-y3 loc-x6-y3)
   deleted: (at-robot loc-x7-y3)
   added: (at-robot loc-x6-y3) (visited loc-x6-y3)
   goals met: 48 of 64
50. (move loc-x6-y3 loc-x5-y3)
   deleted: (at-robot loc-x6-y3)
   added: (at-robot loc-x5-y3) (visited loc-x5-y3)
   goals met: 49 of 64
51. (move loc-x5-y3 loc-x5-y2)
   deleted: (at-robot loc-x5-y3)
   added: (at-robot loc-x5-y2) (visited loc-x5-y2)
   goals met: 50 of 64
52. (move loc-x5-y2 loc-x5-y3)
   deleted: (at-robot loc-x5-y2)
   added: (at-robot loc-x5-y3)
   goals met: 50 of 64
53. (move loc-x5-y3 loc-x5-y4)
   deleted: (at-robot loc-x5-y3)
   added: (at-robot loc-x5-y4) (visited loc-x5-y4)
   goals met: 51 of 64
54. (move loc-x5-y4 loc-x5-y5)
   deleted: (at-robot loc-x5-y4)
   added: (at-robot loc-x5-y5) (visited loc-x5-y5)
   goals met: 52 of 64
55. (move loc-x5-y5 loc-x5-y6)
   deleted: (at-robot loc-x5-y5)
   added: (at-robot loc-x5-y6) (visited loc-x5-y6)
   goals met: 53 of 64
56. (move loc-x5-y6 loc-x5-y7)
   deleted: (at-robot loc-x5-y6)
   added: (at-robot loc-x5-y7) (visited loc-x5-y7)
   goals met: 54 of 64
57. (move loc-x5-y7 loc-x6-y7)
   deleted: (at-robot loc-x5-y7)
   added: (at-robot loc-x6-y7) (visited loc-x6-y7)
   goals met: 55 of 64
58. (move loc-x6-y7 loc-x6-y6)
   deleted: (at-robot loc-x6-y7)
   added: (at-robot loc-x6-y6) (visited loc-x6-y6)
   goals met: 56 of 64
59. (move loc-x6-y6 loc-x7-y6)
   deleted: (at-robot loc-x6-y6)
   added: (at-robot loc-x7-y6) (visited loc-x7-y6)
   goals met: 57 of 64
60. (move loc-x7-y6 loc-x7-y7)
   deleted: (at-robot loc-x7-y6)
   added: (at-robot loc-x7-y7) (visited loc-x7-y7)
   goals met: 58 of 64
61. (move loc-x7-y7 loc-x7-y6)
   deleted: (at-robot loc-x7-y7)
   added: (at-robot loc-x7-y6)
   goals met: 58 of 64
62. (move loc-x7-y6 loc-x6-y6)
   deleted: (at-robot loc-x7-y6)
   added: (at-robot loc-x6-y6)
   goals met: 58 of 64
63. (move loc-x6-y6 loc-x6-y5)
   deleted: (at-robot loc-x6-y6)
   added: (at-robot loc-x6-y5) (visited loc-x6-y5)
   goals met: 59 of 64
64. (move loc-x6-y5 loc-x6-y4)
   deleted: (at-robot loc-x6-y5)
   added: (at-robot loc-x6-y4) (visited loc-x6-y4)
   goals met: 60 of 64
65. (move loc-x6-y4 loc-x7-y4)
   deleted: (at-robot loc-x6-y4)
   added: (at-robot loc-x7-y4) (visited loc-x7-y4)
   goals met: 61 of 64
66. (move loc-x7-y4 loc-x7-y5)
   deleted: (at-robot loc-x7-y4)
   added: (at-robot loc-x7-y5) (visited loc-x7-y5)
   goals met: 62 of 64
67. (move loc-x7-y5 loc-x6-y5)
   deleted: (at-robot loc-x7-y5)
   added: (at-robot loc-x6-y5)
   goals met: 62 of 64
68. (move loc-x6-y5 loc-x5-y5)
   deleted: (at-robot loc-x6-y5)
   added: (at-robot loc-x5-y5)
   goals met: 62 of 64
69. (move loc-x5-y5 loc-x5-y4)
   deleted: (at-robot loc-x5-y5)
   added: (at-robot loc-x5-y4)
   goals met: 62 of 64
70. (move loc-x5-y4 loc-x5-y3)
   deleted: (at-robot loc-x5-y4)
   added: (at-robot loc-x5-y3)
   goals met: 62 of 64
71. (move loc-x5-y3 loc-x4-y3)
   deleted: (at-robot loc-x5-y3)
   added: (at-robot loc-x4-y3)
   goals met: 62 of 64
72. (move loc-x4-y3 loc-x3-y3)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x3-y3) (visited loc-x3-y3)
   goals met: 63 of 64
73. (move loc-x3-y3 loc-x4-y3)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x4-y3)
   goals met: 63 of 64
74. (move loc-x4-y3 loc-x5-y3)
   deleted: (at-robot loc-x4-y3)
   added: (at-robot loc-x5-y3)
   goals met: 63 of 64
75. (move loc-x5-y3 loc-x6-y3)
   deleted: (at-robot loc-x5-y3)
   added: (at-robot loc-x6-y3)
   goals met: 63 of 64
76. (move loc-x6-y3 loc-x6-y2)
   deleted: (at-robot loc-x6-y3)
   added: (at-robot loc-x6-y2) (visited loc-x6-y2)
   goals met: 64 of 64
